Ran Plan for project: `modules-aws` dir: `AWS` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ec2.aws_instance.instance_ec2[0] has changed
~ resource "aws_instance" "instance_ec2" {
        id                                   = "i-0fdef17891c42ee2d"
        tags                                 = {
            "Name" = "webapp-1"
        }
        # (29 unchanged attributes hidden)



      + ebs_block_device {
          + delete_on_termination = false
          + device_name           = "/dev/sdh"
          + encrypted             = false
          + iops                  = 100
          + tags                  = {
              + "Name" = "ebs-webapp"
            }
          + throughput            = 0
          + volume_id             = "vol-0a77530325fdc3b06"
          + volume_size           = 8
          + volume_type           = "gp2"
        }



        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ec2.aws_instance.instance_ec2[0] must be replaced
-/+ resource "aws_instance" "instance_ec2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:185183580378:instance/i-0fdef17891c42ee2d" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0fdef17891c42ee2d" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-031216960b94f4dac" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-42.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.42" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "54.166.198.51" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "webapp-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "73b7243fc129af6abcf39e0a0d73270e6a68aedb" -> "6c9546faecebbebda2f17283e78adebf4727378b" # forces replacement
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdh" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {
              - "Name" = "ebs-webapp"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0a77530325fdc3b06" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-054697084dca462b4" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # module.ec2.aws_instance.instance_ec2[1] must be replaced
-/+ resource "aws_instance" "instance_ec2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:185183580378:instance/i-03e06f063f2d325e3" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-03e06f063f2d325e3" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0c23d2e4de369b12f" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-24.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.24" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "23.23.65.60" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "webapp-2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "73b7243fc129af6abcf39e0a0d73270e6a68aedb" -> "6c9546faecebbebda2f17283e78adebf4727378b" # forces replacement
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-03e8792bcb05f88c6" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # module.elastic_block_storage.aws_ebs_volume.ebs_instance must be replaced
-/+ resource "aws_ebs_volume" "ebs_instance" {
      ~ arn                  = "arn:aws:ec2:us-east-1:185183580378:volume/vol-0a77530325fdc3b06" -> (known after apply)
      ~ availability_zone    = "us-east-1b" -> (known after apply) # forces replacement
      ~ encrypted            = false -> (known after apply)
      ~ id                   = "vol-0a77530325fdc3b06" -> (known after apply)
      ~ iops                 = 100 -> 0
      + kms_key_id           = (known after apply)
      - multi_attach_enabled = false -> null
      + snapshot_id          = (known after apply)
        tags                 = {
            "Name" = "ebs-webapp"
        }
      ~ throughput           = 0 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.elastic_block_storage.aws_volume_attachment.ebs_attachment must be replaced
-/+ resource "aws_volume_attachment" "ebs_attachment" {
      ~ id          = "vai-2978885755" -> (known after apply)
      ~ instance_id = "i-0fdef17891c42ee2d" -> (known after apply) # forces replacement
      ~ volume_id   = "vol-0a77530325fdc3b06" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.elastic_load_balance.aws_alb_target_group_attachment.tg-instances-attachement[0] must be replaced
-/+ resource "aws_alb_target_group_attachment" "tg-instances-attachement" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:185183580378:targetgroup/tg-webapp/b8d5e2015f837f08-20220621170149957000000002" -> (known after apply)
      ~ target_id        = "i-0fdef17891c42ee2d" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.elastic_load_balance.aws_alb_target_group_attachment.tg-instances-attachement[1] must be replaced
-/+ resource "aws_alb_target_group_attachment" "tg-instances-attachement" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:185183580378:targetgroup/tg-webapp/b8d5e2015f837f08-20220621170149923500000001" -> (known after apply)
      ~ target_id        = "i-03e06f063f2d325e3" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.

Changes to Outputs:
~ ip_address = [
      - "54.166.198.51",
      - "23.23.65.60",
      + (known after apply),
      + (known after apply),
    ]

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p modules-aws`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ec2-34-227-7-226.compute-1.amazonaws.com/lock?id=andrehirata77%252Fterraform%252FAWS%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p modules-aws`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 6 to add, 0 to change, 6 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
